; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	spectrograph4 - mode
	infrared3 - mode
	image1 - mode
	infrared0 - mode
	infrared2 - mode
	Star0 - direction
	GroundStation2 - direction
	Star4 - direction
	Star1 - direction
	Star3 - direction
	GroundStation5 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
	Planet12 - direction
	Star13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 infrared0)
	(supports instrument0 infrared3)
	(calibration_target instrument0 Star1)
	(supports instrument1 infrared0)
	(supports instrument1 infrared2)
	(supports instrument1 spectrograph4)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet14)
)
(:goal (and
	(have_image Star6 image1)
	(have_image Star7 infrared3)
	(have_image Planet8 infrared3)
	(have_image Planet9 spectrograph4)
	(have_image Star10 infrared2)
	(have_image Star11 spectrograph4)
	(have_image Planet12 infrared2)
	(have_image Star13 spectrograph4)
	(have_image Planet14 infrared0)
))

)

; plan
1. (turn_to satellite0 groundstation5 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 groundstation5)
   goals met: 0 of 9
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 9
3. (calibrate satellite0 instrument1 groundstation5)
   added: (calibrated instrument1)
   goals met: 0 of 9
4. (turn_to satellite0 planet9 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 planet9)
   goals met: 0 of 9
5. (take_image satellite0 planet9 instrument1 spectrograph4)
   added: (have_image planet9 spectrograph4)
   goals met: 1 of 9
6. (turn_to satellite0 planet14 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet14)
   goals met: 1 of 9
7. (take_image satellite0 planet14 instrument1 infrared0)
   added: (have_image planet14 infrared0)
   goals met: 2 of 9
8. (turn_to satellite0 planet12 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet12)
   goals met: 2 of 9
9. (take_image satellite0 planet12 instrument1 infrared2)
   added: (have_image planet12 infrared2)
   goals met: 3 of 9
10. (turn_to satellite0 star10 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star10)
   goals met: 3 of 9
11. (take_image satellite0 star10 instrument1 infrared2)
   added: (have_image star10 infrared2)
   goals met: 4 of 9
12. (turn_to satellite0 star11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star11)
   goals met: 4 of 9
13. (take_image satellite0 star11 instrument1 spectrograph4)
   added: (have_image star11 spectrograph4)
   goals met: 5 of 9
14. (turn_to satellite0 star13 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star13)
   goals met: 5 of 9
15. (take_image satellite0 star13 instrument1 spectrograph4)
   added: (have_image star13 spectrograph4)
   goals met: 6 of 9
16. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 6 of 9
17. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 6 of 9
18. (turn_to satellite0 star1 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star1)
   goals met: 6 of 9
19. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 6 of 9
20. (turn_to satellite0 planet8 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet8)
   goals met: 6 of 9
21. (take_image satellite0 planet8 instrument0 infrared3)
   added: (have_image planet8 infrared3)
   goals met: 7 of 9
22. (turn_to satellite0 star6 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star6)
   goals met: 7 of 9
23. (take_image satellite0 star6 instrument0 image1)
   added: (have_image star6 image1)
   goals met: 8 of 9
24. (turn_to satellite0 star7 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star7)
   goals met: 8 of 9
25. (take_image satellite0 star7 instrument0 infrared3)
   added: (have_image star7 infrared3)
   goals met: 9 of 9
